#include<stdio.h>

int main_01(void)
{
    int i, j, k;
    int array[3][3][3] = {
        {
            {1,  2,  3},  {4,  5,  6},  {7,  8,  9}
        },
        {
            {10, 11, 12}, {13, 14, 15}, {16, 17, 18}
        },
        {
            {19, 20, 21}, {22, 23, 24}, {25, 26, 27}
        }
    };// 앞 큰방 갯수, 중간 그룹 갯수, 맨 뒤 인원

    // 3차원 배열 데이터 출력
    for (i = 0; i < 3; i++)
    {
        for (j = 0; j < 3; j++)
        {
            for (k = 0; k < 3; k++)
            {
                printf("%3d", array[i][j][k]);
            }
            printf("\n");
        }
        printf("-------------------\n");
    }

    return 0;
}